app/Http/Controllers/HomeController.php

    public function panel(Request $request){

        $nombreModal = session('nombreModal') ?? null;
        $fup_users = DB::table('unirodada_users')->where('unirodada_users.group', 'fup')->count();

        if ($nombreModal !== null)
            $request->session()->forget('nombreModal');

        return view('auth.Dashbord.index')
            ->with('Modulos', $request->user()->userModules)
            ->with('user_workshops', Auth::user()->workshops)
            ->with('nombreModal', $nombreModal)->with('fup_users', $fup_users)
            ->with('Ejes',ejes::all())
            ->with('workshops',Workshop::all())
---
select * from `workshops` where `workshops`.`deleted_at` is null
select * from `ejes`